Tekla.Structures.Model.InvalidRadiusException
The InvalidRadiusException class represents an error when, cannot connect parts with a cylindrical section having the provided radius.

Tekla.Structures.Model.InvalidRadiusException.#ctor
Initializes a new instance of the InvalidRadiusException class with "Cannot connect parts with a cylindrical section having the provided radius" error message.